<template>
  <div class="app-container">
    <div>
      <p class="title">消费协议</p>
      <p>
        <br />
      </p>
      <p>
        公主喵按照本协议的规定及不时发布的操作规则提供基于互联网的消费服务(以下称“消费服务”)，为获得消费服务，服务使用
        人(以下称“用户”或“您”)请在使用消费服务之前仔细阅读《消费协议》（以下简称“本协议”）。本协议已对与用户的权益具有或
        可能具有重大关系的条款用不同字号、粗体字予以标注，请用户注意阅读。用户为使用公主喵服务而进行消费即视为用户完
        全接受本协议项下的全部条款以及我们后续对条款做的随时修改。公主喵可能会不定期的更新本协议内容，用户可以在公主喵
        星球发出的公告、邮件查阅最新版协议条款。用户在消费之前，应仔细阅读本协议，尤其是重点提示条款，如用户不同意本充
        值协议及/或对其的修改，请停止使用公主喵提供的服务。
      </p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;特别提示：未成年用户使用公主喵消费服务，必须得到家长或其他监护人的知情并同意，否则不得使用本消费服务。公主喵星
        球对于未成年用户使用本服务过程中的行为，以及因其使用本服务而产生的一切后果不承担任何责任。公主喵有权根据法律
        及用户的使用情况，独立判断用户的行为是否有效。若最终判定无效的情况下，公主喵有权暂时冻结用户的账户，根据法律
        法规处理。
      </p>
      <p>
        <br />
      </p>
      <p>1、关于雪花</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;雪花是公主喵为用户提供的用于公主喵相关消费的虚拟货币，也是公主喵消费平台的中间货币，可以自由转换成平台下各产品的消费货币。
        雪花不能兑换成人民币。
      </p>
      <p>
        <br />
      </p>
      <p>2、服务内容</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;公主喵的消费系统提供银行卡、支付宝、微信支付等不同的消费方式。用户使用相关平台进行消费，可以为公主喵账号消费雪花
        或以增加相关网络游戏中用户帐号所有的虚拟币的数量。
      </p>
      <p>
        <br />
      </p>
      <p>3、操作方法</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;3.1用户可以在此消费系统上自由选择具体的消费方式，并按相应页面提示的程序完成消费。</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;3.2使用公主喵消费方式消费游戏成功后有5分钟的调整时间，用户请在消费成功的5分钟后尝试进入游戏。</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;3.3用户使用各种消费方式进行消费后，应保留消费订单号或消费卡以作为今后发生问题核对依据凭证（用户就消费服务投诉，
        但未有任何消费卡或其他有效凭证佐证的，公主喵将不会作出任何补偿或赔偿）。
      </p>
      <p>
        <br />
      </p>
      <p>4、风险提示</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;4.1在使用消费方式时，用户务必仔细确认自己的帐号并仔细选择相关操作选项。若因为用户自身输入帐号错误、操作不当或
        不了解消费计费方式等因素造成充错帐号、错选消费种类等情形而损害自身权益的，公主喵将不会作任何补偿或赔偿。
      </p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;4.2若用户以非法的方式，或使用非公主喵所指定的消费方式进行消费，公主喵不保证该消费顺利或者正确完成。若因此
        造成用户权益受损时，公主喵不会作任何补偿或赔偿，公主喵同时保留随时终止该用户公主喵账号及使用各项消费服务 的权利。
      </p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;4.3用户不得通过公主喵消费进行任何违法犯罪活动，否则公主喵有权终止服务，情节严重的，依法移交司法机关进行处
        理。
      </p>
      <p>
        <br />
      </p>
      <p>5、消费成功后</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;消费成功后，消费所增加的账号内虚拟货币可由用户自由使用，但公主喵不会提供任何退还或逆向兑换服务。</p>
      <p>
        <br />
      </p>
      <p>6、渠道商服务手续费用</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;各消费方式对应的渠道商可能会按其标准制定相关消费渠道手续费用（可能会在消费操作页面或渠道商其他页面上提示），并
        在用户消费时收取。公主喵特此提醒：请用户务必注意各消费方式的渠道商服务手续费，并按自己的需求选取消费方式。
      </p>
      <p>
        <br />
      </p>
      <p>7、若因公主喵消费方式原因造成用户消费失实并经查证属实的，公主喵将根据用户消费情况作出变动措施：</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;7.1 因消费方式原因，造成系统消费额小于用户实际消费额的，公主喵予以补其差额；</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;7.2 因消费方式原因，造成系统消费额大于用户实际消费额的，公主喵有权追回差额；</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;7.3 因渠道商收取服务手续费用等原因造成系统消费额小于用户实际消费额的，不属于用户消费失实。</p>
      <p>
        <br />
      </p>
      <p>8、服务变更、中断或终止</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;8.1
        公主喵可以根据业务需求随时变更服务或更新本协议的条款，但应在相关的页面上及时提示修改内容。修改后的服务协
        议一旦在页面上公布即代替原来的服务协议。用户可随时造访公主喵在线消费付费网站，查阅最新消费服务协议。
      </p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;8.2 如因系统维护或升级的需要而需暂停网络消费服务，公主喵将尽可能事先进行通告。</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;8.3 如发生下列任何一种情形，公主喵有权随时中断或终止向用户提供本协议项下的网络服务而无需通知用户：
      </p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;&emsp;&emsp;(a) 用户提供的个人资料不真实；</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;&emsp;&emsp;(b) 用户违反本协议中规定的使用规则。</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;8.4
        8.4除前款所述情形外，公主喵同时保留在不事先通知用户的情况下随时中断或终止部分或全部网络消费服务的权利，对于
        消费服务的中断或终止而造成的任何损失，公主喵无需对用户或任何第三方承担任何责任。
      </p>
      <p>
        <br />
      </p>
      <p>9. 免责声明和损害赔偿</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;9.1 发生下列情况时，公主喵免于承担任何法律责任：</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;&emsp;&emsp;（a）用户因使用第三方支付渠道消费过程中发生的相关争议；</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;&emsp;&emsp;（b）由于用户将密码告知他人导致的用户财产损失；</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;&emsp;&emsp;（c）因用户个人故意或重大过失，或本协议之外的第三方所造成的用户财产损失；</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;&emsp;&emsp;（d））由不可抗力及不可预见的情势导致的各种情况和纠纷；不可抗力和不可预见情势包括：黑客攻击、电信部门技术调整导致
        重大影响、政府管制导致的暂时关闭、病毒侵袭。
      </p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;9.2
        用户同意保障和维护公主喵及其他用户的利益，如因用户违反有关法律、法规或本协议项下的任何条款而给公主喵或任何第三人造成损失，
        用户同意承担由此造成的损害赔偿责任。
      </p>
      <p>
        <br />
      </p>
      <p>10. 其他</p>
      <p>
        <br />
      </p>
      <p>&emsp;&emsp;10.1 本协议的订立、执行和解释及争议的解决均应适用中国法律，不适用冲突法。</p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;10.2
        若您与公主喵之间发生任何争议或纠纷，双方应友好协商；如协商不成，双方同意将争议提交本协议签订地（中国浙江省杭州市西湖区）
        有管辖权的人民法院排他诉讼解决。
      </p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;10.3
        本协议项下所有的通知均可通过重要页面公告、电子邮件传送等方式进行；该等通知于公告或发送之日视为已送达收件人。
      </p>
      <p>
        <br />
      </p>
      <p>
        &emsp;&emsp;10.4
        本协议的条款无论因何种原因导致部分无效，其余条款仍然有效，对双方具有约束力。本协议任何条款的放弃均不应被视为对该等条款或任
        何其他条款的进一步或继续放弃，公主喵在本协议项下未主张的任何权利或条款，不构成对该权利或条款的放弃。
      </p>
      <p>
        <br />
      </p>
    </div>
  </div>
</template>

<style>
.app-container {
  padding: 20px;
  margin-top: 100px;
}

.title {
  font-size: 14px;
  color: #252525;
  font-weight: 600;
}
</style>
